package shkoda.kitgroup.testproject;

/**
 * Created by Nightingale on 27.08.2015.
 *
 * Есть персонаж. У персонажа есть здоровье, мана, энергия.
 * Есть тип урона и сам урон. Персонаж имеет броню.
 * У персонажа есть активные и пассивные способности.
 * На него возможно наложить бафы и дебафы (http://wowslovar.ru/baf/).
 * Есть инвентарь в размере n объектов.
 *
 * Есть башня. Имеет жизнь и ману.
 * Она может атаковать и может создавать ауру. Имеет броню и способности.
 *
 * Есть осел. Который имеет ману. у него есть инвентарь в размере 4 объектов.
 *
 * Описать структуру классов и взаимодействие c#
 * (например персонаж атакует башню, башня применяет баф на персонажа,
 *  персонаж отдает вещь ослу и наоборот)
 */
public class Main {
    public static void main(String[] args) {
        System.out.println("27/08/2015");
    }
}
